In [68]:
print("Hi There Today I will use Gaussian Naive Bayes Model!!")

Hi There Today I will use Gaussian Naive Bayes Model!!

In [42]:
import pandas as pd 
import numpy as np
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [44]:

y = df['Survived']
X = df.drop(["Survived"],axis='columns')

In [45]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [46]:
dummies = pd.get_dummies(X.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [47]:
X = pd.concat([X,dummies],axis='columns')
X.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [48]:
X = X.drop('Sex',axis='columns')
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [49]:
X.columns[X.isna().any()]

Index(['Age'], dtype='object')

In [50]:
X.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [51]:
X.Age = X.Age.fillna(X.Age.mean())

In [52]:
X.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [53]:
Z = pd.concat([X,y],axis='columns')
Z

     Pclass        Age     Fare  female  male  Survived
0         3  22.000000   7.2500       0     1         0
1         1  38.000000  71.2833       1     0         1
2         3  26.000000   7.9250       1     0         1
3         1  35.000000  53.1000       1     0         1
4         3  35.000000   8.0500       0     1         0
..      ...        ...      ...     ...   ...       ...
886       2  27.000000  13.0000       0     1         0
887       1  19.000000  30.0000       1     0         1
888       3  29.699118  23.4500       1     0         0
889       1  26.000000  30.0000       0     1         1
890       3  32.000000   7.7500       0     1         0

[891 rows x 6 columns]

In [54]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2)

In [55]:
from sklearn.model_selection import KFold

In [56]:
kf = KFold(n_splits = 3)
kf

KFold(n_splits=3, random_state=None, shuffle=False)

In [63]:
def get_scores(model,X_train,X_test,y_train,y_test):
    model.fit(X_train,y_train)
    return model.score(X_test,y_test)

In [64]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [65]:
get_scores(model,X_train,X_test,y_train,y_test)

0.7374301675977654

In [66]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 0, 0, 1, 1, 0, 0], dtype=int64)

In [67]:
model.predict_proba(X_test[:10])

array([[5.53021305e-02, 9.44697870e-01],
       [9.17016155e-01, 8.29838451e-02],
       [5.58264984e-02, 9.44173502e-01],
       [9.84372797e-01, 1.56272028e-02],
       [9.80273468e-01, 1.97265318e-02],
       [8.89204223e-01, 1.10795777e-01],
       [1.40637042e-50, 1.00000000e+00],
       [9.19838341e-16, 1.00000000e+00],
       [9.84730733e-01, 1.52692670e-02],
       [8.90023367e-01, 1.09976633e-01]])